In [1]:
import pandas as pd

In [7]:
#1-dimensional
series = pd.Series(["BMW", "Nissan", "Toyota"])

In [3]:
series

0       BMW
1    Nissan
2    Toyota
dtype: object

In [6]:
colours = pd.Series(["Blue", "White", "Grey"])
colours

0     Blue
1    White
2     Grey
dtype: object

In [9]:
#2-dimensional
car_data = pd.DataFrame({"Car make":series, "Colour": colours})
car_data

  Car make Colour
0      BMW   Blue
1   Nissan  White
2   Toyota   Grey

In [11]:
#import data
car_sales=pd.read_csv("data/car-sales.csv")
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [12]:
#exporting a dataframe
car_sales_head=car_sales.head()
car_sales_head.to_csv("exported-car-sales.csv")

## Describe Data

In [14]:
#Attribute
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [16]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [17]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [18]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [19]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes